#### [`repos`] Terraform Plan 📖`success`

<a href="https://app.terraform.io/app/cdktf-team/prebuilt-providers/runs/run-kM3KQs46UHhXmnqE" target="_blank">Remote Plan Link ↗️</a>

<details><summary>Show Plan</summary>

```tf
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cdktf-team/prebuilt-providers/runs/run-kM3KQs46UHhXmnqE

Waiting for the plan to start...

Terraform v1.9.5
on linux_amd64
Initializing plugins and modules...
data.github_team.cdktf-team-cdktf: Reading...
data.github_team.cdktf-team-cdktf: Read complete after 8s [id=6602018]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # github_actions_secret.cdktf-provider-acme_repo_secret-nuget-api-key_898F76CC must be replaced
-/+ resource "github_actions_secret" "cdktf-provider-acme_repo_secret-nuget-api-key_898F76CC" {
      ~ created_at      = "2023-10-17 12:58:48 +0000 UTC" -> (known after apply)
      ~ id              = "cdktf-provider-acme:NUGET_API_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-17 12:58:48 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.cdktf-provider-archive_repo_secret-nuget-api-key_2110B3EC must be replaced
-/+ resource "github_actions_secret" "cdktf-provider-archive_repo_secret-nuget-api-key_2110B3EC" {
      ~ created_at      = "2023-10-17 12:59:33 +0000 UTC" -> (known after apply)
      ~ id              = "cdktf-provider-archive:NUGET_API_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-17 12:59:33 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.cdktf-provider-aws_repo_secret-nuget-api-key_018820E1 must be replaced
-/+ resource "github_actions_secret" "cdktf-provider-aws_repo_secret-nuget-api-key_018820E1" {
      ~ created_at      = "2023-10-17 12:59:02 +0000 UTC" -> (known after apply)
      ~ id              = "cdktf-provider-aws:NUGET_API_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-17 12:59:02 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.cdktf-provider-azuread_repo_secret-nuget-api-key_97A5C7BF must be replaced
-/+ resource "github_actions_secret" "cdktf-provider-azuread_repo_secret-nuget-api-key_97A5C7BF" {
      ~ created_at      = "2023-10-17 12:59:01 +0000 UTC" -> (known after apply)
      ~ id              = "cdktf-provider-azuread:NUGET_API_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-17 12:59:01 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.cdktf-provider-azurerm_repo_secret-nuget-api-key_B379FCE6 must be replaced
-/+ resource "github_actions_secret" "cdktf-provider-azurerm_repo_secret-nuget-api-key_B379FCE6" {
      ~ created_at      = "2023-10-17 12:58:50 +0000 UTC" -> (known after apply)
      ~ id              = "cdktf-provider-azurerm:NUGET_API_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-17 12:58:50 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.cdktf-provider-cloudflare_repo_secret-nuget-api-key_A931AD3A must be replaced
-/+ resource "github_actions_secret" "cdktf-provider-cloudflare_repo_secret-nuget-api-key_A931AD3A" {
      ~ created_at      = "2023-10-17 12:59:19 +0000 UTC" -> (known after apply)
      ~ id              = "cdktf-provider-cloudflare:NUGET_API_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-17 12:59:19 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.cdktf-provider-cloudinit_repo_secret-nuget-api-key_A091B563 must be replaced
-/+ resource "github_actions_secret" "cdktf-provider-cloudinit_repo_secret-nuget-api-key_A091B563" {
      ~ created_at      = "2023-10-17 12:59:15 +0000 UTC" -> (known after apply)
      ~ id              = "cdktf-provider-cloudinit:NUGET_API_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-17 12:59:15 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.cdktf-provider-databricks_repo_secret-nuget-api-key_6D2BAC35 must be replaced
-/+ resource "github_actions_secret" "cdktf-provider-databricks_repo_secret-nuget-api-key_6D2BAC35" {
      ~ created_at      = "2023-10-17 12:59:18 +0000 UTC" -> (known after apply)
      ~ id              = "cdktf-provider-databricks:NUGET_API_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-17 12:59:18 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.cdktf-provider-datadog_repo_secret-nuget-api-key_DF9FB246 must be replaced
-/+ resource "github_actions_secret" "cdktf-provider-datadog_repo_secret-nuget-api-key_DF9FB246" {
      ~ created_at      = "2023-10-17 12:59:21 +0000 UTC" -> (known after apply)
      ~ id              = "cdktf-provider-datadog:NUGET_API_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-17 12:59:21 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.cdktf-provider-digitalocean_repo_secret-nuget-api-key_14C20E41 must be replaced
-/+ resource "github_actions_secret" "cdktf-provider-digitalocean_repo_secret-nuget-api-key_14C20E41" {
      ~ created_at      = "2023-10-17 12:59:24 +0000 UTC" -> (known after apply)
      ~ id              = "cdktf-provider-digitalocean:NUGET_API_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-17 12:59:24 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.cdktf-provider-dnsimple_repo_secret-nuget-api-key_FC8C140C must be replaced
-/+ resource "github_actions_secret" "cdktf-provider-dnsimple_repo_secret-nuget-api-key_FC8C140C" {
      ~ created_at      = "2023-10-17 12:58:45 +0000 UTC" -> (known after apply)
      ~ id              = "cdktf-provider-dnsimple:NUGET_API_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-17 12:58:45 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.cdktf-provider-docker_repo_secret-nuget-api-key_8148DBF4 must be replaced
-/+ resource "github_actions_secret" "cdktf-provider-docker_repo_secret-nuget-api-key_8148DBF4" {
      ~ created_at      = "2023-10-17 12:59:36 +0000 UTC" -> (known after apply)
      ~ id              = "cdktf-provider-docker:NUGET_API_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-17 12:59:36 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.cdktf-provider-external_repo_secret-nuget-api-key_01C855B7 must be replaced
-/+ resource "github_actions_secret" "cdktf-provider-external_repo_secret-nuget-api-key_01C855B7" {
      ~ created_at      = "2023-10-17 12:59:07 +0000 UTC" -> (known after apply)
      ~ id              = "cdktf-provider-external:NUGET_API_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-17 12:59:07 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.cdktf-provider-github_repo_secret-nuget-api-key_DBBBAA3C must be replaced
-/+ resource "github_actions_secret" "cdktf-provider-github_repo_secret-nuget-api-key_DBBBAA3C" {
      ~ created_at      = "2023-10-17 12:58:47 +0000 UTC" -> (known after apply)
      ~ id              = "cdktf-provider-github:NUGET_API_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-17 12:58:47 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.cdktf-provider-gitlab_repo_secret-nuget-api-key_84145AE2 must be replaced
-/+ resource "github_actions_secret" "cdktf-provider-gitlab_repo_secret-nuget-api-key_84145AE2" {
      ~ created_at      = "2023-10-17 12:59:12 +0000 UTC" -> (known after apply)
      ~ id              = "cdktf-provider-gitlab:NUGET_API_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-17 12:59:12 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.cdktf-provider-google_repo_secret-nuget-api-key_28AB2AB3 must be replaced
-/+ resource "github_actions_secret" "cdktf-provider-google_repo_secret-nuget-api-key_28AB2AB3" {
      ~ created_at      = "2023-10-17 12:59:31 +0000 UTC" -> (known after apply)
      ~ id              = "cdktf-provider-google:NUGET_API_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-17 12:59:31 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.cdktf-provider-googlebeta_repo_secret-nuget-api-key_5BCC1FE6 must be replaced
-/+ resource "github_actions_secret" "cdktf-provider-googlebeta_repo_secret-nuget-api-key_5BCC1FE6" {
      ~ created_at      = "2023-10-17 12:58:58 +0000 UTC" -> (known after apply)
      ~ id              = "cdktf-provider-googlebeta:NUGET_API_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-17 12:58:58 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.cdktf-provider-helm_repo_secret-nuget-api-key_3490B5D8 must be replaced
-/+ resource "github_actions_secret" "cdktf-provider-helm_repo_secret-nuget-api-key_3490B5D8" {
      ~ created_at      = "2023-10-17 12:59:00 +0000 UTC" -> (known after apply)
      ~ id              = "cdktf-provider-helm:NUGET_API_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-17 12:59:00 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.cdktf-provider-ionoscloud_repo_secret-nuget-api-key_3C839629 must be replaced
-/+ resource "github_actions_secret" "cdktf-provider-ionoscloud_repo_secret-nuget-api-key_3C839629" {
      ~ created_at      = "2023-10-17 12:58:56 +0000 UTC" -> (known after apply)
      ~ id              = "cdktf-provider-ionoscloud:NUGET_API_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-17 12:58:56 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.cdktf-provider-kubernetes_repo_secret-nuget-api-key_4D361A62 must be replaced
-/+ resource "github_actions_secret" "cdktf-provider-kubernetes_repo_secret-nuget-api-key_4D361A62" {
      ~ created_at      = "2023-10-17 12:58:51 +0000 UTC" -> (known after apply)
      ~ id              = "cdktf-provider-kubernetes:NUGET_API_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-17 12:58:51 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.cdktf-provider-local_repo_secret-nuget-api-key_F75700CA must be replaced
-/+ resource "github_actions_secret" "cdktf-provider-local_repo_secret-nuget-api-key_F75700CA" {
      ~ created_at      = "2023-10-17 12:59:27 +0000 UTC" -> (known after apply)
      ~ id              = "cdktf-provider-local:NUGET_API_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-17 12:59:27 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.cdktf-provider-newrelic_repo_secret-nuget-api-key_750884FF must be replaced
-/+ resource "github_actions_secret" "cdktf-provider-newrelic_repo_secret-nuget-api-key_750884FF" {
      ~ created_at      = "2023-10-17 12:58:52 +0000 UTC" -> (known after apply)
      ~ id              = "cdktf-provider-newrelic:NUGET_API_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-17 12:58:52 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.cdktf-provider-null_repo_secret-nuget-api-key_346434B9 must be replaced
-/+ resource "github_actions_secret" "cdktf-provider-null_repo_secret-nuget-api-key_346434B9" {
      ~ created_at      = "2023-10-17 12:58:53 +0000 UTC" -> (known after apply)
      ~ id              = "cdktf-provider-null:NUGET_API_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-17 12:58:53 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.cdktf-provider-okta_repo_secret-nuget-api-key_E8108C68 must be replaced
-/+ resource "github_actions_secret" "cdktf-provider-okta_repo_secret-nuget-api-key_E8108C68" {
      ~ created_at      = "2023-10-17 12:59:23 +0000 UTC" -> (known after apply)
      ~ id              = "cdktf-provider-okta:NUGET_API_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-17 12:59:23 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.cdktf-provider-opentelekomcloud_repo_secret-nuget-api-key_96C931CB must be replaced
-/+ resource "github_actions_secret" "cdktf-provider-opentelekomcloud_repo_secret-nuget-api-key_96C931CB" {
      ~ created_at      = "2023-10-17 12:59:05 +0000 UTC" -> (known after apply)
      ~ id              = "cdktf-provider-opentelekomcloud:NUGET_API_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-17 12:59:05 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.cdktf-provider-pagerduty_repo_secret-nuget-api-key_9684F18A must be replaced
-/+ resource "github_actions_secret" "cdktf-provider-pagerduty_repo_secret-nuget-api-key_9684F18A" {
      ~ created_at      = "2023-10-17 12:59:29 +0000 UTC" -> (known after apply)
      ~ id              = "cdktf-provider-pagerduty:NUGET_API_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-17 12:59:29 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.cdktf-provider-postgresql_repo_secret-nuget-api-key_B098F836 must be replaced
-/+ resource "github_actions_secret" "cdktf-provider-postgresql_repo_secret-nuget-api-key_B098F836" {
      ~ created_at      = "2023-10-17 12:59:35 +0000 UTC" -> (known after apply)
      ~ id              = "cdktf-provider-postgresql:NUGET_API_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-17 12:59:35 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.cdktf-provider-random_repo_secret-nuget-api-key_B34F9280 must be replaced
-/+ resource "github_actions_secret" "cdktf-provider-random_repo_secret-nuget-api-key_B34F9280" {
      ~ created_at      = "2023-10-17 12:59:06 +0000 UTC" -> (known after apply)
      ~ id              = "cdktf-provider-random:NUGET_API_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-17 12:59:06 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.cdktf-provider-snowflake_repo_secret-nuget-api-key_53670C24 must be replaced
-/+ resource "github_actions_secret" "cdktf-provider-snowflake_repo_secret-nuget-api-key_53670C24" {
      ~ created_at      = "2023-10-17 12:59:14 +0000 UTC" -> (known after apply)
      ~ id              = "cdktf-provider-snowflake:NUGET_API_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-17 12:59:14 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.cdktf-provider-spotinst_repo_secret-nuget-api-key_27872E5F must be replaced
-/+ resource "github_actions_secret" "cdktf-provider-spotinst_repo_secret-nuget-api-key_27872E5F" {
      ~ created_at      = "2023-10-17 12:59:17 +0000 UTC" -> (known after apply)
      ~ id              = "cdktf-provider-spotinst:NUGET_API_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-17 12:59:17 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.cdktf-provider-tfe_repo_secret-nuget-api-key_3E194AB0 must be replaced
-/+ resource "github_actions_secret" "cdktf-provider-tfe_repo_secret-nuget-api-key_3E194AB0" {
      ~ created_at      = "2023-10-17 12:59:20 +0000 UTC" -> (known after apply)
      ~ id              = "cdktf-provider-tfe:NUGET_API_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-17 12:59:20 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.cdktf-provider-time_repo_secret-nuget-api-key_CB68CC7C must be replaced
-/+ resource "github_actions_secret" "cdktf-provider-time_repo_secret-nuget-api-key_CB68CC7C" {
      ~ created_at      = "2023-10-17 12:59:04 +0000 UTC" -> (known after apply)
      ~ id              = "cdktf-provider-time:NUGET_API_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-17 12:59:04 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.cdktf-provider-tls_repo_secret-nuget-api-key_7DF998E9 must be replaced
-/+ resource "github_actions_secret" "cdktf-provider-tls_repo_secret-nuget-api-key_7DF998E9" {
      ~ created_at      = "2023-10-17 12:58:54 +0000 UTC" -> (known after apply)
      ~ id              = "cdktf-provider-tls:NUGET_API_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-17 12:58:54 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.cdktf-provider-upcloud_repo_secret-nuget-api-key_B178E8E5 must be replaced
-/+ resource "github_actions_secret" "cdktf-provider-upcloud_repo_secret-nuget-api-key_B178E8E5" {
      ~ created_at      = "2023-10-17 12:59:09 +0000 UTC" -> (known after apply)
      ~ id              = "cdktf-provider-upcloud:NUGET_API_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-17 12:59:09 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.cdktf-provider-vault_repo_secret-nuget-api-key_321F3FAD must be replaced
-/+ resource "github_actions_secret" "cdktf-provider-vault_repo_secret-nuget-api-key_321F3FAD" {
      ~ created_at      = "2023-10-17 12:59:10 +0000 UTC" -> (known after apply)
      ~ id              = "cdktf-provider-vault:NUGET_API_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-17 12:59:10 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 35 to add, 0 to change, 35 to destroy.


```

</details>

*Pusher: @mutahhir, Action: `pull_request_target`, Working Directory: ``, Workflow: `Plan`*